[{"name":"Revolution","date":"2018-03-11T00:00:00.000Z","slug":"revolution","description":"Jesus launched His mission with these words: 'The time has come'. It would be easy to miss the significance. They are words that speak of revolution. A revolution of love.  A revolution that our world desperately needs.","images":{"320":"/uploads/production/2018/03/11/7hdy9pk5jr_mark_centered.jpg","640":"/uploads/production/2018/03/11/3zd3c956bt_mark_centered.jpg","960":"/uploads/production/2018/03/11/4yasw7qsd0_mark_centered.jpg","1280":"/uploads/production/2018/03/11/8czfr64yc_mark_centered.jpg","1920":"/uploads/production/2018/03/11/956n52dsqj_mark_centered.jpg","2560":"/uploads/production/2018/03/11/1r188l26c_mark_centered.jpg"},"image":"/uploads/production/2018/03/11/4yasw7qsd0_mark_centered.jpg","passage":"Mark 1:1-15","url":"/resources/revolution","questions":[{"type":"question","lead":"In what ways do you feel the frustration of living in this world?","followup":["How do you find yourself joining in the song of the first revolution (the rebel Kingdom of the world)?","In what ways are we tempted to just 'accept things the way they are'?"]},{"type":"question","lead":"What is it about Jesus and His Kingdom that amazes you?","followup":["Why is baptism such a powerful symbol of the revolution? ","What can we do to help us remember the nearness of the kingdom?"]},{"type":"question","lead":"How are we in danger of holding back rather than giving ourselves completely to this Kingdom?","followup":["Why do you find it so hard to confess your sin?","How might pride prevent you from repenting?","What would it look like for you to believe the good news this week?"]}],"base_url":"https://www.globe.church"},{"name":"The Pecking Order","date":"2018-03-04T00:00:00.000Z","slug":"the-pecking-order","description":"Do you ever find it hard to walk into church? What are the ways in which we behave that might serve ourselves and exclude and harm others? Jesus has given us a meal to set that straight. It is a stunning foundation for the life of a church. ","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 11:17-34","url":"/resources/the-pecking-order","questions":[{"type":"question","lead":"At church how might we be in danger of acting in a way that makes others feel excluded/ashamed?","followup":["When have you ever felt like you don’t really belong?","Do you find church a hard place to come to? What makes it hard?","Why do we behave like that? How is it feeding our ego?"]},{"type":"question","lead":"Read again about the simple meal that expresses a profound truth (v23-26). How would a right understanding of the Lord’s Supper change our behaviour as a church?","followup":["What does the death of Jesus tell us about the nature of church?","How might it help with the problems expressed in the previous question?","How do we avoid a ritualistic view of the Lord’s Supper?"]},{"type":"question","lead":"Paul encourages us to examine ourselves. In what ways are we treating church wrongly?","followup":["Why is it serious to be careless about others in church?","How will this change the way you walk into church next Sunday?","Do you stay for dinner after the service? Do you stay? Why/why not?","How can your time in church to do more good than harm?"]}],"base_url":"https://www.globe.church"},{"name":"Treating One Another Rightly","date":"2018-02-25T00:00:00.000Z","slug":"treating-one-another-rightly","description":"Paul unpacks how we are to relate to one another as a church family. In particular, as men and women. Headship is good - not in an authoritarian way - but as a responsibility to be used for the good of others. Of course, in a church like Corinth who say, ‘I have the right to do anything’ of course things are going to go wrong. ","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 11:2-16","url":"/resources/treating-one-another-rightly","questions":[{"type":"question","lead":"In John 13 how does Jesus provide a model of what real headship looks like towards His disciples?","followup":["Why does Peter refuse to have his feet washed? ","Why might we resist any sense of headship? ","If we say that we want to be our own head what are we saying? (Remember the only being who is His own head)","How does all this help us understand what Paul means when he says that man is the head of woman? "]},{"type":"question","lead":"In a house the walls are built first then the roof. Why is the order of creation important? Is there a difference in importance or value between walls and roof?","followup":["Why is crucial that men and women together are the image of God? (Gen 1:27)","How do you see the battle of the sexes working itself out in our culture? Does that ever creep into our church thinking? "]},{"type":"question","lead":"Are there any attitudes that you need to change as a result of what you've heard or spoken about?","followup":["How should men treat women within Globe church? How should women treat men?","How might it affect our praying?","Our talking about each other?","Our valuing each other?"]}],"base_url":"https://www.globe.church"},{"name":"Turn and Tilt","date":"2018-02-18T00:00:00.000Z","slug":"turn-and-tilt","description":"So often we find ourselves with a mirror pointed at ourselves; whatever you do, in whatever interaction you have the mirror just shows you. As we continue on in our journey through 1 Corinthians we're going to see Paul challenge us to turn the mirror around and tilt it. Turn it to face other people and tilt it to God.","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 10:15-11:1","url":"/resources/turn-and-tilt","questions":[{"type":"question","lead":"Phil introduced the sermon with the illustration of a mirror which always points back at us. What's the problem with always looking out for my own good?","followup":["Can you think of experiences where you or others have only been thinking about yourselves?","In Frozen, Elsa sings \"No right, nor wrong, no rules for me, I’m free!\", why is this an attractive idea to us and our culture?","What fruit does that have in our society? What have been the results in your own life?"]},{"type":"question","lead":"How does the cross liberate us to think about the good of others?","followup":["Which aspect of the cross most motivate you to think about others (it tells us it's not about us; God takes care of our good; it gives us an example)?","In what situations are you finding it difficult to seek the good of others?","Is your enjoyment of God something your think about as you speak with people who don't know Christ?"]},{"type":"question","lead":"What changes might you need to make to your witness and church life, knowing people's greatest good is to see God through your life?","followup":["As you witness for Christ, are there times where seeking their good means joining in and at other times not?","What impact would it have on your time with church if you embraced the other focussed example of Christ?"]}],"base_url":"https://www.globe.church"},{"name":"Connected","date":"2018-02-11T00:00:00.000Z","slug":"connected","description":"Paul is very clear that we are to flee from idolatry. He's really clear - don't mess around, instead run in the opposite direction. In this section he has one more reason to show us why idolatry is so dangerous to us. And it all has to do with participation… that is who we are connected to.","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 10:14-22","url":"/resources/connected","questions":[{"type":"question","lead":"How are you in danger of denying the unseen spiritual world (materialism) or disconnecting it from the physical world in which you live?","followup":["How do you tend to view material things? What problems does this disconnection between material and spiritual produce in your life?","Remember the story of Elisha in 2 Kings 6:17… In what ways do the seen and unseen world actually occupy the same reality?"]},{"type":"question","lead":"What does it mean that we participate in the body and blood of Jesus?","followup":["How does the physical act of the cross connect to a spiritual reality that wins us forgiveness?","How can we help each other to enjoy and delight in the unseen spiritual realities of forgiveness and relationship with Jesus?"]},{"type":"question","lead":"Paul draws a link between idols (physical/material things) and demons. Does this link surprise you?","followup":["Demons are not weird little things but are deceivers who love to lead people astray. Why is idolatry always deceptive?","What are the things that you are in danger of being ensnared by? How might you be tempted to think they are no big deal?","When Paul says flee from idolatry - where do you think he is expecting us to flee to?"]}],"base_url":"https://www.globe.church"},{"name":"Don’t flirt with crocodiles","date":"2018-02-04T00:00:00.000Z","slug":"dont-flirt-with-crocodiles","description":"Your security as a Christian depends on a realistic view of the danger we are in. If the gospel produces complacency something has gone badly wrong. In 1 Corinthians 10 Paul sounds a strong warning to the church. He wants to snap them out of their complacency. He wants them to see the danger. But his ultimate goal is not anxious paranoia - but a deep and joyful confidence in God. Don’t flirt with crocodiles. ","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 9:24-10:14","url":"/resources/dont-flirt-with-crocodiles","questions":[{"type":"question","lead":"The first warning was not to run aimlessly; how does the future prize keep us from aimless running?","followup":["Why is freedom not the same as 'doing whatever I want’?","How much does the future shape the way you live your life? How much did it shape Paul’s?","Does it strike you as strange that Paul thinks he might be disqualified?"]},{"type":"question","lead":"How might we be in danger of arrogantly assuming that we won’t fall?","followup":["Why was the Old Testament written?","Why do we have the tendency to think that we will be fine?","Why is idolatry so appealing to us? "]},{"type":"question","lead":"How is God’s character our ultimate source of security (v13)?","followup":["Why is it a problem if we only hear the warning and miss the promise?","Where do you need to stop flirting with crocodiles?"]}],"base_url":"https://www.globe.church"},{"name":"The One Big Thing","date":"2018-01-28T00:00:00.000Z","slug":"the-one-big-thing","description":"Our lifestyles are full of so many different things- what we eat, where we live, who we spend time with. What is the one big thing that drives those parts of our lives? For the Corinthians that was easy- 'me'. They lived every part of their lives for personal happiness. Paul had a greater one big thing for his life- saving as many people as possible. He made himself a slave, handcuffing his lifestyle to anyone who needed the gospel. This is our great calling too. Let's ask this one big thing of all the little parts of our lives: how can I maximise as many people as possible hearing about Jesus?","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 9:19-23","url":"/resources/the-one-big-thing","questions":[{"type":"question","lead":"Think about some recent life decisions you made. What were the different factors, and what was in the driving seat?","followup":["In what ways are you tempted to let 'me' be the one big thing for your lifestyle?","How do you see 'me' driving London lifestyles? Is there anything you need to watch out for?"]},{"type":"question","lead":"Think through your spare time, relationships, and your future plans. How would things change if saving people was your one big thing?","followup":["How did people enslave themselves to you to help you be saved?","How can thinking about Jesus becoming human help you make costly changes to your lifestyle for others?","Our lifestyles are full of so many different things- what we eat, where we live, who we spend time with. What is the one big thing that drives those parts of our lives?"]}],"base_url":"https://www.globe.church"},{"name":"What does freedom look like?","date":"2018-01-21T00:00:00.000Z","slug":"what-does-freedom-look-like","description":"Paul is still addressing the issue of food sacrificed to idols. It is a massive issue. It represents the desire for the church in Corinth to simply indulge themselves in all that the culture has to offer. Paul points to his own example to help this church get clear in their thinking on the nature of true freedom. It doesn’t mean demanding all I entitled to. Instead it means giving up my rights for the sake of the glorious gospel. ","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 9:1-13","url":"/resources/what-does-freedom-look-like","questions":[{"type":"question","lead":"What are the gods in London that we are most tempted to ‘eat from their table’?","followup":["Why are these gods attractive to us? ","Why might we be tempted to not think it is that serious?"]},{"type":"question","lead":"Why is it important that Paul is entitled to support for his gospel preaching?","followup":["What does it tell you about the nature of God that He is bothered that even oxen should get food as they work?","In what ways might we be tempted to undervalue those who work for the gospel?","In what ways might we undervalue the work we do for the gospel? "]},{"type":"question","lead":"Paul gives up his rights because he has been entrusted with the gospel. Do you see the gospel as something that is so valuable that it is worth giving up everything for?","followup":["Talk about the difference between a volunteer and someone who is compelled.","In what ways are we in danger of behaving like volunteers? ","How does the example of Jesus motivate us to give up our rights?"]}],"base_url":"https://www.globe.church"},{"name":"Mr. Know Much; Knowing verses Loving.","date":"2018-01-14T00:00:00.000Z","slug":"mr-know-much-knowing-verses-loving","description":"In Acts 15 the church council takes one verse to cover the answer to the question 'should I eat food sacrificed to idols?' Paul takes a whole section in his letter! But the difference is that Paul is driving at a much bigger issue which the church needs to face into; they have become puffed up on their knowledge, and have forgotten how to love…","images":{"320":"/uploads/production/2018/01/14/1lzpyts9ui_Don_t_feed_the_egos_unmarked.jpg","640":"/uploads/production/2018/01/14/6t7mt3accw_Don_t_feed_the_egos_unmarked.jpg","960":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","1280":"/uploads/production/2018/01/14/3fvyer3k3m_Don_t_feed_the_egos_unmarked.jpg","1920":"/uploads/production/2018/01/14/6sh5rahb2t_Don_t_feed_the_egos_unmarked.jpg","2560":"/uploads/production/2018/01/14/1utg7wsacw_Don_t_feed_the_egos_unmarked.jpg"},"image":"/uploads/production/2018/01/14/93dbms2zu8_Don_t_feed_the_egos_unmarked.jpg","passage":"1 Corinthians 8:1-13","url":"/resources/mr-know-much-knowing-verses-loving","questions":[{"type":"question","lead":"Talk about a time when you have felt threatened or hurt by someone else's ego, or a case when you have hurt someone else by yours…","followup":["Why are egos are dangerous things?"]},{"type":"question","lead":"Knowledge had currency to the church in Corinth; and that fed their egos. Where do you see yourself at most risk from feeding yours?","followup":["What kind of things puff you up?","When are you tempted to use your knowledge in an area which might cause someone else to stumble?"]},{"type":"question","lead":"Paul isn't anti-knowledge, he want us to know about God! But, it is better to love like Christ. How can we improve how we love our church family?","followup":["Jesus starved his ego so that we might be saved; what does starving our egos look like?","Who do you know who models this well? What do they do?"]}],"base_url":"https://www.globe.church"},{"name":"We Live by the Word of God","date":"2018-01-07T00:00:00.000Z","slug":"we-live-by-the-word","description":"If we're honest with ourselves; culture does influence us. But as Christians our ultimate shaping comes from the word of God. In our city, nation and the world the Bible is under attack, and we're encouraged just to blend in with that prevalent culture, the culture which shifts and changes like the wind. Paul writes to Timothy not to fall into that trap; don't be ashamed of the scriptures because nothing gives life like they do. They are God breathed, and all we need.","images":{"320":"/uploads/production/2018/01/08/g85nj5yr9_PPT_16_9.001.jpg","640":"/uploads/production/2018/01/08/5jxlbh9e50_PPT_16_9.001.jpg","960":"/uploads/production/2018/01/08/42tql42xsx_PPT_16_9.001.jpg","1280":"/uploads/production/2018/01/08/6f0e524018_PPT_16_9.001.jpg","1920":"/uploads/production/2018/01/08/9ufd0m8lca_PPT_16_9.001.jpg","2560":"/uploads/production/2018/01/08/29x4vwst61_PPT_16_9.001.jpg"},"image":"/uploads/production/2018/01/08/42tql42xsx_PPT_16_9.001.jpg","passage":"2 Timothy 3:10-4:5","url":"/resources/we-live-by-the-word","questions":[{"type":"question","lead":"All scripture is God breathed and we cannot separate God from his words. What place in your life does the Bible have?","followup":["How often do you read the Bible on your own or with family and friends?","What is your motivation for reading the Bible?","Do you often discuss what you are reading with others?","How do you go about picking what you are going to read?"]},{"type":"question","lead":"Paul writes to Timothy, telling him that scripture will equip the servant of God for every good work (2 Tim 3v17). How has scripture equipped you for good work?","followup":["What does Paul mean by good work in this passage?","Where have you recently be taught, rebuked, corrected or trained by it?","How might you share what you have learnt from scripture with others?"]}],"base_url":"https://www.globe.church"},{"name":"Children of God","date":"2017-12-17T00:00:00.000Z","slug":"children-of-god","description":"","images":{"320":"/uploads/production/2017/12/18/3vzogdkyxh_37457964781_6574a90003_o.jpg","640":"/uploads/production/2017/12/18/7rsgdckusm_37457964781_6574a90003_o.jpg","960":"/uploads/production/2017/12/18/431a9h5w8e_37457964781_6574a90003_o.jpg","1280":"/uploads/production/2017/12/18/x4b98ysua_37457964781_6574a90003_o.jpg","1920":"/uploads/production/2017/12/18/1g0hv5otik_37457964781_6574a90003_o.jpg","2560":"/uploads/production/2017/12/18/5eheq40z6u_37457964781_6574a90003_o.jpg"},"image":"/uploads/production/2017/12/18/431a9h5w8e_37457964781_6574a90003_o.jpg","passage":"Galatians 4:4-7","url":"/resources/children-of-god","questions":[{"type":"question","lead":"God wants you to be in his family; take some time to discuss the significance of this…","followup":["What does God's family (the Trinity) look like?","Why does God want you to be in his family?","Do you feel inside or outside his family? Is that always the case?"]},{"type":"question","lead":"God opens the door and takes the first action to invite you into his family. Is this something you've thought about before? What are the implications of God acting first?","followup":["What would happen if we had to make the first move?","What does this show us about the character of God?"]},{"type":"question","lead":"We used to be in God's family, but like Adam before us, we walked out on God. Jesus was everything we should have been. How do we try and patch our relationship with God on our own through our work?","followup":["Talk about the gospel together; why is Jesus so important to being brought into God's family?","God adopts us as sons and we receive the honours of Christ as co-heirs. How does this change our relationship with God? How does this change our relationship with other Christians?","What are the things we need to remember about being in God's family going into 2018?"]}],"base_url":"https://www.globe.church"},{"name":"You are not defined by your circumstances","date":"2017-12-03T00:00:00.000Z","slug":"you-are-not-defined-by-your-circumstances","description":"\"Stay where you are\" is Paul's call to the Corinthian church. For both them and us this call feels very alien; being discontent is encouraged- get a new job, move to a new place, get a new partner… We're discontent with these things because we place our identity in these things. Paul's message to the Corinthian church is a simple one– stay where you are, remain in the situation that God has put you in because you are not defined by your circumstances, but in Christ.","images":{"320":"/uploads/production/2017/09/07/1gop4zqvn6_the_globe_church_one_corinthians.jpg","640":"/uploads/production/2017/09/07/70taog7qmc_the_globe_church_one_corinthians.jpg","960":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","1280":"/uploads/production/2017/09/07/22f8uefmq1_the_globe_church_one_corinthians.jpg","1920":"/uploads/production/2017/09/07/67qt2jw5ez_the_globe_church_one_corinthians.jpg","2560":"/uploads/production/2017/09/07/7infvvj2fp_the_globe_church_one_corinthians.jpg"},"image":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","passage":"1 Corinthians 7:8-40","url":"/resources/you-are-not-defined-by-your-circumstances","questions":[{"type":"question","lead":"Whatever the situation, the Christian belongs to Christ - you were bought at a price. How does knowing this truth enable you to be content in the circumstance that you are in?","followup":["What does that look like in your singleness / marriage / dating relationship?","In this area where do you find contentment hardest to find?","How can we help one another to be content?","How would you explain Christian contentment to a friend who isn't a Christian?"]},{"type":"question","lead":"Within marriage, love is more than an emotion; it is a commitment. Why should we fight hard for marriage?","followup":["How does marriage as a picture of God and the church help our view of commitment?"]},{"type":"question","lead":"Paul is keen for single people to remain single; so they can have an undivided attention to serving God (v32-35). As a single or married person, how do you see this in your life?","followup":["What does it look like for you to use your time well to serve the Lord?","How can we help one another to serve the Lord?"]}],"base_url":"https://www.globe.church"},{"name":"Life without sex?","date":"2017-11-26T00:00:00.000Z","slug":"life-without-sex","description":"We've seen that the church in Corinth is in a mess, in fact Paul calls their situation a crisis. The issue of sexual immorality is threatening their existence, it's tearing the church apart– that's why Paul's tone is so serious. As we hear from 1 Corinthians 7 we're not going to see the sum total of what the bible says about sex, singleness or marriage, but we are going to see Paul write into a culture that has made sex an idol, and the consequences of that.","images":{"320":"/uploads/production/2017/09/07/1gop4zqvn6_the_globe_church_one_corinthians.jpg","640":"/uploads/production/2017/09/07/70taog7qmc_the_globe_church_one_corinthians.jpg","960":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","1280":"/uploads/production/2017/09/07/22f8uefmq1_the_globe_church_one_corinthians.jpg","1920":"/uploads/production/2017/09/07/67qt2jw5ez_the_globe_church_one_corinthians.jpg","2560":"/uploads/production/2017/09/07/7infvvj2fp_the_globe_church_one_corinthians.jpg"},"image":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","passage":"1 Corinthians 7:1-9","url":"/resources/life-without-sex","questions":[{"type":"question","lead":"Paul uses the word crisis to describe the state of the church. How do you see this seriousness within our culture?","followup":["How might we be tempted to down play the seriousness of sexuality immorality?","How does Jonty’s reminder from 1 Corinthians 6, that we are bought by Christ, cause us to think in light of this?"]},{"type":"question","lead":"The passage describes a life of singleness, without sex, as a good life. Why do we find this hard to accept?","followup":["How does the life of Jesus help us to understand what it means to be human?","How can we support each other in the church to maintain self-control?"]},{"type":"question","lead":"How does Paul’s emphasis on giving and not taking challenge our view of sex?","followup":["How do you respond to Jonty’s challenges around self centred actions; eg demanding sex, masturbation, pornography or even flirting."]}],"base_url":"https://www.globe.church"},{"name":"Taking the Gospel where Christ is not Known","date":"2017-11-20T00:00:00.000Z","slug":"taking-the-gospel-where-christ-is-not-known","description":"There are still so many places where the gospel of Jesus Christ has not been heard and Paul's ministry is focused on reaching them. But if he is going to get there he's going to need a gospel ambition and a costly initiative…","images":{"320":"/uploads/production/2017/11/20/64lt3eof13_20171119.jpg","640":"/uploads/production/2017/11/20/6bqi25atfv_20171119.jpg","960":"/uploads/production/2017/11/20/9rhvh9pvh9_20171119.jpg","1280":"/uploads/production/2017/11/20/68qjllrxgs_20171119.jpg","1920":"/uploads/production/2017/11/20/2stktam1a1_20171119.jpg","2560":"/uploads/production/2017/11/20/2qj1xyxi9s_20171119.jpg"},"image":"/uploads/production/2017/11/20/9rhvh9pvh9_20171119.jpg","passage":"Romans 15:14-22","url":"/resources/taking-the-gospel-where-christ-is-not-known","questions":[{"type":"question","lead":"Paul longs for people to be saved. Reflecting back on the passage and the sermon do you share the same longing?","followup":["How might we go about cultivating this desire?","Why don’t we always feel this ambition and joy?","Who has God put in your life that you would long to be saved?"]},{"type":"pause","body":"\u003cp\u003e“When it comes to preaching the gospel don’t just have the ambition; stretch every sinew in your body to see it realised\"\u003c/p\u003e"},{"type":"question","lead":"What does it look like for you to stretch every sinew to see gospel ambition realised?","followup":["Michael talked about it being costly; what might be the cost for you?","How can we encourage and support one another?"]},{"type":"question","lead":"The focus of Sunday wasn’t just about sharing the gospel here in London, but across the world. Have you thought about serving God in another country?","followup":["If yes; where? Why a call to that place? What are you doing to see that realised?","If no; did Sunday challenge you in this?","How can we better support those who have already gone?     "]}],"base_url":"https://www.globe.church"},{"name":"Conflict is a Killer","date":"2017-10-28T23:00:00.000Z","slug":"conflict-is-a-killer","description":"You can feel the shock in Paul's letter here… \"You can't be serious?! You're taking each other to court?\" He isn't surprised that there is conflict, it's about how the conflict is dealt with in the church. Conflict that is handled poorly will cause disaster to the church, but we're going to see that there is an antidote to it.","images":{"320":"/uploads/production/2017/09/07/1gop4zqvn6_the_globe_church_one_corinthians.jpg","640":"/uploads/production/2017/09/07/70taog7qmc_the_globe_church_one_corinthians.jpg","960":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","1280":"/uploads/production/2017/09/07/22f8uefmq1_the_globe_church_one_corinthians.jpg","1920":"/uploads/production/2017/09/07/67qt2jw5ez_the_globe_church_one_corinthians.jpg","2560":"/uploads/production/2017/09/07/7infvvj2fp_the_globe_church_one_corinthians.jpg"},"image":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","passage":"1 Corinthians 6:1-11","url":"/resources/conflict-is-a-killer","questions":[{"type":"question","lead":"Conflict bubbles up from different areas; carelessness, misunderstanding, personality clash, stubbornness, jealous, being wronged. Which of these resonate with you?","followup":["How can you catch these things earlier or resolve them before they grow?","There is a bigger conflict between God and us caused by sin, how do you see that in your life?"]},{"type":"question","lead":"How did Jonty explain verse three; that we will judge the angels?","followup":["How do you feel about this truth that Paul writes?","How does this change or challenge your view of conflict resolution?"]},{"type":"question","lead":"In verse seven Paul challenges the church ‘Why not rather be wronged?’ Why don’t we like this challenge?","followup":["How does the gospel message of Christ crucifed change our natural resistance to this?","Do you have any conflicts in your life that you need to resolve?"]}],"base_url":"https://www.globe.church"},{"name":"A Kiss on the Lips","date":"2017-10-14T23:00:00.000Z","slug":"a-kiss-on-the-lips","description":"Proverbs 24:26 says 'An honest answer is like a kiss on the lips'. Criticism is hard, we don't like it, but Paul is writing honestly to the church, calling them to repentance. He isn't interested in making them like him. He is going to correct them when they go wrong… he's going to speak truth.","images":{"320":"/uploads/production/2017/09/07/1gop4zqvn6_the_globe_church_one_corinthians.jpg","640":"/uploads/production/2017/09/07/70taog7qmc_the_globe_church_one_corinthians.jpg","960":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","1280":"/uploads/production/2017/09/07/22f8uefmq1_the_globe_church_one_corinthians.jpg","1920":"/uploads/production/2017/09/07/67qt2jw5ez_the_globe_church_one_corinthians.jpg","2560":"/uploads/production/2017/09/07/7infvvj2fp_the_globe_church_one_corinthians.jpg"},"image":"/uploads/production/2017/09/07/7f58r6sfe3_the_globe_church_one_corinthians.jpg","passage":"1 Corinthians 4:14-21","url":"/resources/a-kiss-on-the-lips","questions":[{"type":"question","lead":"Who are your parents in Christ?","followup":["Who do you look up to spiritually?","Who are the people who will correct or challenge you?","Do you make time to spend with them?","Are you a parent to anyone?"]},{"type":"question","lead":"Jonty spoke about the cross having power, how would you describe the power of the cross?","followup":["What impact does this have on your life day to day?","How would you communicate that to someone who wasn't a Christian"]},{"type":"question","lead":"Paul has been warning this church against boasting and making itself impressive. How are you tempted to boast or make yourself look impressive?","followup":["What can we do to ensure Jesus is central to our lives and our only boast?","How can we hold one another to account in this regard?"]}],"base_url":"https://www.globe.church"}]
