[
  {
    "name": "Life without sex?",
    "date": "2017-11-26T00:00:00.000Z",
    "slug": "life-without-sex",
    "passage": "1 Corinthians 7:1-9",
    "url": "http://globe.church/resources/life-without-sex",
    "questions": [
      {
        "type": "question",
        "lead": "Paul uses the word crisis to describe the state of the church. How do you see this seriousness within our culture?",
        "followup": [
          "How might we be tempted to down play the seriousness of sexuality immorality?",
          "How does Jonty’s reminder from 1 Corinthians 6, that we are bought by Christ, cause us to think in light of this?"
        ]
      },
      {
        "type": "question",
        "lead": "The passage describes a life of singleness, without sex, as a good life. Why do we find this hard to accept?",
        "followup": [
          "How does the life of Jesus help us to understand what it means to be human?",
          "How can we support each other in the church to maintain self-control?"
        ]
      },
      {
        "type": "question",
        "lead": "How does Paul’s emphasis on giving and not taking challenge our view of sex?",
        "followup": [
          "How do you respond to Jonty’s challenges around self centred actions; eg demanding sex, masturbation, pornography or even flirting."
        ]
      }
    ]
  },
  {
    "name": "Taking the Gospel where Christ is not Known",
    "date": "2017-11-20T00:00:00.000Z",
    "slug": "taking-the-gospel-where-christ-is-not-known",
    "passage": "Romans 15:14-22",
    "url": "http://globe.church/resources/taking-the-gospel-where-christ-is-not-known",
    "questions": [
      {
        "type": "question",
        "lead": "Paul longs for people to be saved. Reflecting back on the passage and the sermon do you share the same longing?",
        "followup": [
          "How might we go about cultivating this desire?",
          "Why don’t we always feel this ambition and joy?",
          "Who has God put in your life that you would long to be saved?"
        ]
      },
      {
        "type": "pause",
        "body": "\u003cp class=\"p1\"\u003e“When it comes to preaching the gospel don’t just have the ambition; stretch every sinew in your body to see it realised”\u003c/p\u003e"
      },
      {
        "type": "question",
        "lead": "What does it look like for you to stretch every sinew to see gospel ambition realised?",
        "followup": [
          "Michael talked about it being costly; what might be the cost for you?",
          "How can we encourage and support one another?"
        ]
      },
      {
        "type": "question",
        "lead": "The focus of Sunday wasn’t just about sharing the gospel here in London, but across the world. Have you thought about serving God in another country?",
        "followup": [
          "If yes; where? Why a call to that place? What are you doing to see that realised?",
          "If no; did Sunday challenge you in this?",
          "How can we better support those who have already gone?     "
        ]
      }
    ]
  },
  {
    "name": "A Kiss on the Lips",
    "date": "2017-10-14T23:00:00.000Z",
    "slug": "a-kiss-on-the-lips",
    "passage": "1 Corinthians 4:14-21",
    "url": "http://globe.church/resources/a-kiss-on-the-lips",
    "questions": [
      {
        "type": "question",
        "lead": "Who are your parents in Christ?",
        "followup": [
          "Who do you look up to spiritually?",
          "Who are the people who will correct or challenge you?",
          "Do you make time to spend with them?",
          "Are you a parent to anyone?"
        ]
      },
      {
        "type": "question",
        "lead": "Jonty spoke about the cross having power, how would you describe the power of the cross?",
        "followup": [
          "What impact does this have on your life day to day?",
          "How would you communicate that to someone who wasn't a Christian"
        ]
      },
      {
        "type": "question",
        "lead": "Paul has been warning this church against boasting and making itself impressive. How are you tempted to boast or make yourself look impressive?",
        "followup": [
          "What can we do to ensure Jesus is central to our lives and our only boast?",
          "How can we hold one another to account in this regard?"
        ]
      }
    ]
  },
  {
    "name": "Conflict is a Killer",
    "date": "2017-10-28T23:00:00.000Z",
    "slug": "conflict-is-a-killer",
    "passage": "1 Corinthians 6:1-11",
    "url": "http://globe.church/resources/conflict-is-a-killer",
    "questions": [
      {
        "type": "question",
        "lead": "Conflict bubbles up from different areas; carelessness, misunderstanding, personality clash, stubbornness, jealous, being wronged. Which of these resonate with you?",
        "followup": [
          "How can you catch these things earlier or resolve them before they grow?",
          "There is a bigger conflict between God and us caused by sin, how do you see that in your life?"
        ]
      },
      {
        "type": "question",
        "lead": "How did Jonty explain verse three; that we will judge the angels?",
        "followup": [
          "How do you feel about this truth that Paul writes?",
          "How does this change or challenge your view of conflict resolution?"
        ]
      },
      {
        "type": "question",
        "lead": "In verse seven Paul challenges the church ‘Why not rather be wronged?’ Why don’t we like this challenge?",
        "followup": [
          "How does the gospel message of Christ crucifed change our natural resistance to this?",
          "Do you have any conflicts in your life that you need to resolve?"
        ]
      }
    ]
  },
  {
    "name": "You are not defined by your circumstances",
    "description": "\"Stay where you are\" is Paul's call to the Corinthian church. For both them and us this call feels very alien; being discontent is encouraged- get a new job, move to a new place, get a new partner… We're discontent with these things because we place our identity in these things. Paul's message to the Corinthian church is a simple one– stay where you are, remain in the situation that God has put you in because you are not defined by your circumstances, but in Christ.",
    "date": "2017-12-03T00:00:00.000Z",
    "slug": "you-are-not-defined-by-your-circumstances",
    "passage": "1 Corinthians 7:8-40",
    "url": "http://globe.church/resources/you-are-not-defined-by-your-circumstances",
    "questions": [
      {
        "type": "question",
        "lead": "Whatever the situation, the Christian belongs to Christ - you were bought at a price. How does knowing this truth enable you to be content in the circumstance that you are in?",
        "followup": [
          "What does that look like in your singleness / marriage / dating relationship?",
          "In this area where do you find contentment hardest to find?",
          "How can we help one another to be content?",
          "How would you explain Christian contentment to a friend who isn't a Christian?"
        ]
      },
      {
        "type": "question",
        "lead": "Within marriage, love is more than an emotion; it is a commitment. Why should we fight hard for marriage?",
        "followup": [
          "How does marriage as a picture of God and the church help our view of commitment?"
        ]
      },
      {
        "type": "question",
        "lead": "Paul is keen for single people to remain single; so they can have an undivided attention to serving God (v32-35). As a single or married person, how do you see this in your life?",
        "followup": [
          "What does it look like for you to use your time well to serve the Lord?",
          "How can we help one another to serve the Lord?"
        ]
      }
    ]
  }
]
